[
    {
      "id": 1,
      "picture": "https://plus.unsplash.com/premium_photo-1664392388804-d728a3637d7f?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=441&q=80",
      "name": "Pailin Chongchitnant",
      "years_of_experience": 20,
      "likes": 1234,
      "description": "She is a Thai-Canadian chef, cookbook author, and YouTuber who specializes in Thai cuisine. She hosts the popular YouTube channel Hot Thai Kitchen, where she shares her love and knowledge of Thai food with her audience.",
      "recipes": [
        {
          "_id":11,
          "name": "Pad Thai (Stir-Fried Rice Noodles with Shrimp)",
          "ingredients": [
            "200g dried rice noodles",
            "1/2 lb. medium shrimp, peeled and deveined",
            "1/2 cup firm tofu, diced into small pieces",
            "2 tbsp. vegetable oil",
            "2 cloves garlic, minced"
          ],
          "cooking_method": "Soak the rice noodles in warm water for about 20 minutes until soft. In a wok or large skillet, heat the oil over medium-high heat. Add the shrimp and tofu, and stir-fry until the shrimp is pink and the tofu is golden brown. Push the shrimp and tofu to one side of the wok and add the egg. Scramble until set, then mix everything together. Drain the spaghetti, reserving some of the pasta water. Add the spaghetti to the skillet with the pancetta and toss to coat. Remove from heat and add the egg mixture, stirring quickly to combine. Serve with chopped peanuts and lime wedges on the side.",
          "rating": 4.0
        },
        {
          "_id":12,
          "name": "Massaman Curry",
          "ingredients": [
            "2 lbs. boneless beef, cut into bite-sized pieces",
            "2 cans coconut milk",
            "1/4 cup massaman curry paste",
            "3 tbsp. tamarind paste",
            "3 tbsp. palm sugar"
          ],
          "cooking_method": "In a large pot or Dutch oven, heat 1 can of coconut milk over medium-high heat. Add the curry paste and stir until fragrant.Add the beef and stir-fry until browned. Add the tamarind paste, palm sugar, cinnamon sticks, cardamom pods, cloves, and bay leaves. Stir until everything is well mixed. Add the onion and potatoes, and stir-fry for another minute. Add the second can of coconut milk and enough water to cover the ingredients. Bring to a boil, then reduce heat and simmer for about 1 hour or until the beef is tender. Add the roasted peanuts and stir well. Serve with steamed rice.",
          "rating": 4.9
        },
        {
          "_id":13,
          "name": "Mango Sticky Rice",
          "ingredients": [
            "1 1/2 cups glutinous rice",
            "1 1/2 cups coconut milk",
            "1/2 cup sugar",
            "1/4 tsp. salt",
            "2 ripe mangoes, peeled and sliced"
          ],
          "cooking_method": "Soak the glutinous rice in water for about 2 hours, then drain. In a pot, combine the rice, coconut milk, sugar, and salt. Stir well. Bring to a boil over high heat, then reduce heat to low and cover. Cook for about 20 minutes or until the rice is tender and the liquid has been absorbed. Remove from heat and let it sit for about",
          "rating": 4.2
        }
      ]
    },
    {
      "id": 2,
      "picture": "https://plus.unsplash.com/premium_photo-1661503056330-de5e10db730d?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",    
      "name": "David Thompson",
      "years_of_experience": 9,
      "likes": 787,
      "description": "He is an Australian-born chef and cookbook author who has made a name for himself as an expert in Thai cuisine. He is the founder of the award-winning restaurant Nahm in Bangkok, and has authored several books on Thai cooking.",
      "recipes": [
        {
          "_id":21,
          "name": "Gaeng Hang Lay (Northern-Style Pork Curry)",
          "ingredients": [
            "2 lbs. pork belly or shoulder, sliced into bite-sized pieces",
            "1/2 cup sliced shallots",
            "3 garlic cloves, minced",
            "1/2 cup sliced ginger",
            "1/2 cup sliced galangal"
          ],
          "cooking_method": "In a large pot, heat some oil over medium-high heat. Add shallots, garlic, ginger, and galangal, and stir-fry until fragrant.Add the pork and stir-fry until browned. Add the curry powder, shrimp paste, turmeric, and salt, and stir-fry for another minute. Add enough water to cover the pork, then bring to a boil. Reduce heat and simmer for about 1 hour or until the pork is tender. Add the tamarind water and palm sugar, and stir well. Add the roasted peanuts and coconut cream, and simmer for another 10-15 minutes. Serve with steamed rice.",
          "rating": 3.9
        },
        {
          "_id":22,
          "name": "Tom Yum Goong (Spicy Shrimp Soup)",
          "ingredients": [
            "2 cups water",
            "2 stalks lemongrass, bruised",
            "3 kaffir lime leaves",
            "3 shallots, sliced",
            "3 garlic cloves, minced"
          ],
          "cooking_method": "In a pot, bring the water, lemongrass, and kaffir lime leaves to a boil. Add the shallots, garlic, galangal, and Thai chilies, and simmer for 5-10 minutes until fragrant. Add the shrimp and fish sauce, and simmer for another 2-3 minutes until the shrimp is pink and cooked through. Remove from heat and stir in the lime juice and cilantro. Serve hot with steamed rice.",
          "rating": 4.5
        },
        {
          "_id":23,
          "name": "Pad Gra Pao Gai (Thai Basil Chicken)",
          "ingredients": [
            "1 lb. ground chicken",
            "3 tbsp. vegetable oil",
            "5 garlic cloves, minced",
            "5 Thai chilies, chopped",
            "1/2 cup sliced onion"
          ],
          "cooking_method": "In a wok or large skillet, heat the oil over high heat. Add the garlic and Thai chilies, and stir-fry for 1 minute until fragrant. Add the ground chicken and stir-fry until browned and cooked through. Add the onion and bell pepper, and stir-fry for another minute. Add the oyster sauce, soy sauce, fish sauce, and sugar, and stir well. Add the Thai basil leaves and stir-fry for another",
          "rating": 4.7
        }
      ]
    },
    {
      "id": 3,
      "picture": "https://images.unsplash.com/photo-1541614101331-1a5a3a194e92?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=465&q=80",
      "name": "Ian Kittichai",
      "years_of_experience": 16,
      "likes": 1674,
      "description": "He is a Thai celebrity chef, restaurateur, and cookbook author who has gained international recognition for his modern take on Thai cuisine. He has opened several restaurants in Thailand and around the world, including Kittichai in New York City.",
      "recipes": [
        {
          "_id":31,
          "name": "Green Curry with Chicken and Eggplant",
          "ingredients": [
            "1 lb. boneless, skinless chicken thighs, cut into bite-sized",
            "1 tbsp. vegetable oil",
            "2 tbsp. green curry paste",
            "1 can (14 oz.) coconut milk",
            "1/2 cup chicken broth"
          ],
          "cooking_method": "In a large pot or Dutch oven, heat the oil over medium-high heat. Add the green curry paste and stir-fry for 1-2 minutes until fragrant. Add the chicken and stir-fry until browned. Add the coconut milk, chicken broth, fish sauce, and palm sugar, and stir well. Add the eggplant and simmer for about 15-20 minutes until the chicken is cooked through and the eggplant is tender. Remove from heat and stir in the Thai basil leaves. Serve hot with steamed rice.",
          "rating": 4.5
        },
        {
          "_id":32,
          "name": "Tom Klong Pla Kem (Spicy and Sour Smoked Fish Soup)",
          "ingredients": [
            "2 cups water",
            "1/2 cup smoked fish, flaked",
            "3 shallots, sliced",
            "3 garlic cloves, minced",
            "2 tbsp. galangal, sliced"
          ],
          "cooking_method": "In a pot, bring the water to a boil. Add the smoked fish, shallots, garlic, galangal, and kaffir lime leaves, and simmer for 5-10 minutes until fragrant. Add the tamarind paste, fish sauce, and Thai chilies, and simmer for another 2-3 minutes. Remove from heat and stir in the cilantro. Serve hot with steamed rice..",
          "rating": 4.4
        },
        {
          "_id":33,
          "name": "Massaman Curry with Beef and Potatoes",
          "ingredients": [
            "1 lb. beef stew meat, cut into bite-sized pieces",
            "1 tbsp. vegetable oil",
            "2 tbsp. Massaman curry paste",
            "1 can (14 oz.) coconut milk",
            "1 cup beef broth"
          ],
          "cooking_method": "In a large pot or Dutch oven, heat the oil over medium-high heat. Add the Massaman curry paste and stir-fry for 1-2 minutes until fragrant. Add the beef and stir-fry until browned. Add the coconut milk, beef broth, tamarind paste, fish sauce, and palm sugar, and stir well. Add the potatoes and simmer for about 45-60 minutes until the beef is tender and the potatoes are cooked through. Remove from heat and stir in the roasted peanuts. Serve hot with steamed rice.",
          "rating": 4.9
        }
      ]
    },
    {
      "id": 4,
      "picture": "https://plus.unsplash.com/premium_photo-1663013691446-33ff176e32fa?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
      "name": "Andy Ricker",
      "years_of_experience": 14,
      "likes": 145,
      "description": "He is an American chef and restaurateur who is known for his expertise in Thai cuisine. He is the founder of the Pok Pok restaurant chain, which features authentic Thai dishes, and has been awarded several James Beard awards for his culinary work.",
      "recipes": [
        {
          "_id":41,
          "name": "Khao Soi (Northern Thai Curry Noodle Soup)",
          "ingredients": [
            "1 lb. boneless, skinless chicken thighs, cut into bite-sized",
            "basil leaves",
            "garlic",
            "2 tbsp. red curry paste",
            "parmesan cheese",
            "olive oil"
          ],
          "cooking_method": "In a large pot or Dutch oven, heat the oil over medium-high heat. Add the red curry paste and stir-fry for 1-2 minutes until fragrant. Add the chicken and stir-fry until browned. Add the coconut milk, chicken broth, fish sauce, and palm sugar, and stir well. Simmer for about 15-20 minutes until the chicken is cooked through. Meanwhile, cook the fresh egg noodles according to the package instructions. To serve, place the cooked noodles in a bowl and ladle the curry soup over the top. Garnish with chopped cilantro, sliced green onions, and crispy fried noodles. Serve hot with lime wedges.",
          "rating": 4.6
        },
        {
          "_id":42,
          "name": "Sai Oua (Northern Thai Herb Sausage)",
          "ingredients": [
            "1 lb. ground pork",
            "onion",
            "1/4 cup chopped shallots",
            "celery",
            "garlic",
            "1 tbsp. ground turmeric",
            "beef broth",
            "white wine"
          ],
          "cooking_method": "To make Sai Oua (Northern Thai Herb Sausage), In a large bowl, mix together the ground pork, lemongrass, galangal, shallots, garlic, ground turmeric, chili flakes, cumin, coriander, fish sauce, and palm sugar until well combined. Remove the veal shanks from the pan and set aside. In the same pan, sauté diced onion, carrots, celery, and garlic until softened. Add tomato paste and cook for 1-2 minutes. Add beef broth and white wine and bring to a simmer. Return the veal shanks to the pan, cover, and simmer for 2-3 hours or until the meat is tender and falls off the bone. Serve hot with lettuce leaves.",
          "rating": 4.8
        },
        {
          "_id":43,
          "name": "Yam Samun Phrai (Northern Thai Herbal Salad)",
          "ingredients": [
            "1 lb. ground chicken",
            "3 tbsp. vegetable oil",
            "5 garlic cloves, minced",
            "5 Thai chilies, chopped",
            "1/2 cup sliced onion"
          ],
          "cooking_method": "To make Yam Samun Phrai (Northern Thai Herbal Salad), Soak the rice noodles in cold water for 30 minutes. Add white wine and saffron threads and cook until the wine is absorbed. Add hot chicken or vegetable broth, a ladleful at a time, stirring constantly until the broth is absorbed before adding more. Continue cooking and adding broth until the rice is creamy and tender, about 18-20 minutes. Stir in grated parmesan cheese and butter until melted and creamy. Serve immediately with additional grated parmesan cheese on top.Serve hot.",
          "rating": 4.8
        }
      ]
    },
    {
      "id": 5,
      "picture": "https://plus.unsplash.com/premium_photo-1661609755775-0537b3ca7658?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
      "name": "Thitid Ton Tassanakajohn ",
      "years_of_experience": 24,
      "likes": 1698,
      "description": "He is a Thai chef who has gained a reputation for his innovative approach to Thai cuisine. He is the owner and chef of the Michelin-starred restaurant Le Du in Bangkok, which features a fusion of Thai and Western flavors.",
      "recipes": [
        {
          "_id":51,
          "name": "Gaeng Hang Lay (Northern-Style Pork Curry)",
          "ingredients": [
            "2 lbs. pork belly or shoulder, sliced into bite-sized pieces",
            "1/2 cup sliced shallots",
            "3 garlic cloves, minced",
            "1/2 cup sliced ginger",
            "1/2 cup sliced galangal"
          ],
          "cooking_method": "In a large pot, heat some oil over medium-high heat. Add shallots, garlic, ginger, and galangal, and stir-fry until fragrant.Add the pork and stir-fry until browned. Add the curry powder, shrimp paste, turmeric, and salt, and stir-fry for another minute. Add enough water to cover the pork, then bring to a boil. Reduce heat and simmer for about 1 hour or until the pork is tender. Add the tamarind water and palm sugar, and stir well. Add the roasted peanuts and coconut cream, and simmer for another 10-15 minutes. Serve with steamed rice.",
          "rating": 4.6
        },
        {
          "_id":52,
          "name": "Pad Gra Pao Gai (Thai Basil Chicken)",
          "ingredients": [
            "spaghetti",
            "pancetta",
            "garlic",
            "eggs",
            "parmesan cheese",
            "black pepper"
          ],
          "cooking_method": "To make Pad Gra Pao Gai (Thai Basil Chicken), cook spaghetti in boiling salted water until al dente. While the spaghetti is cooking, cook diced pancetta in a pan until crispy. Add minced garlic and cook for 1-2 minutes. In a separate bowl, whisk together eggs, grated parmesan cheese, and black pepper. Drain the cooked spaghetti and add it to the pan with the pancetta and garlic. Remove the pan from the heat and add the egg mixture, tossing the spaghetti quickly to coat. The heat from the spaghetti will cook the eggs and create a creamy sauce. Serve hot with additional grated parmesan cheese and black pepper on top.",
          "rating": 4.8
        },
        {
          "_id":53,
          "name": "Mango Sticky Rice",
          "ingredients": [
            "ladyfingers",
            "espresso",
            "Marsala wine",
            "mascarpone cheese",
            "heavy cream",
            "cocoa powder"
          ],
          "cooking_method": "To make Mango Sticky Rice, start by brewing strong espresso and adding Marsala wine. In a separate bowl, whisk together mascarpone cheese and heavy cream until light and fluffy. Dip ladyfingers in the espresso mixture and arrange them in a single layer in a dish. Spread half of the mascarpone mixture over the ladyfingers. Repeat with another layer of ladyfingers and the remaining mascarpone mixture. Cover and refrigerate for at least 2-3 hours or overnight. Before serving, dust the top with cocoa powder.",
          "rating": 4.7
        }
      ]
    },
    {
      "id": 6,
      "picture": "https://plus.unsplash.com/premium_photo-1661335322969-1c6524fd810c?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1887&q=80",
      "name": "Duangporn Bo Songvisava",
      "years_of_experience": 10,
      "likes": 14511,
      "description": "She is a Thai chef and co-owner of the Michelin-starred restaurant Bo.Lan in Bangkok, which focuses on sustainable and traditional Thai cuisine. She has also been recognized for her efforts in promoting Thai cuisine and culture globally.",
      "recipes": [
        {
          "_id":61,
          "name": "Green Curry with Chicken and Eggplant",
          "ingredients": [
            "linguine pasta",
            "clams",
            "garlic",
            "white wine",
            "olive oil",
            "red pepper flakes",
            "parsley"
          ],
          "cooking_method": "To make Green Curry with Chicken and Eggplant, cook linguine pasta in boiling salted water until al dente. While the pasta is cooking, rinse and scrub the clams under cold water to remove any grit. In a large pan, heat olive oil and sauté minced garlic and red pepper flakes until fragrant. Add the clams and white wine to the pan, cover and cook until the clams open up, about 5-7 minutes. Discard any unopened clams. Drain the pasta and add it to the pan with the clams and sauce. Toss well to coat the pasta with the sauce. Garnish with chopped parsley and serve hot.",
          "rating": 4.9
        },
        {
          "_id":62,
          "name": "Sai Oua (Northern Thai Herb Sausage)",
          "ingredients": [
            "veal shanks",
            "flour",
            "onion",
            "carrot",
            "celery",
            "tomato paste",
            "beef broth",
            "white wine",
            "garlic",
            "lemon zest",
            "parsley"
          ],
          "cooking_method": "To make Sai Oua (Northern Thai Herb Sausage), season veal shanks with salt and pepper and dust them with flour. In a large pot, heat olive oil and sear the veal shanks until browned on both sides. Remove the veal shanks from the pot and set aside. In the same pot, sauté diced onion, carrot, celery, and minced garlic until soft. Add tomato paste, beef broth, and white wine to the pot and bring to a boil. Return the veal shanks to the pot and reduce the heat to low. Cover and simmer for 2-3 hours or until the meat is fork-tender. Before serving, garnish with lemon zest and chopped parsley.",
          "rating": 4.8
        },
        {
          "_id":63,
          "name": "Khao Soi",
          "ingredients": [
            "1 lb. boneless, skinless chicken thighs, cut into bite-sized",
            "sugar",
            "vanilla extract",
            "gelatin",
            "fresh berries"
          ],
          "cooking_method": "In a large pot or Dutch oven, heat the red curry paste over medium-high heat until fragrant. Add the chicken and stir-fry until browned. Add the coconut milk, chicken broth, palm sugar, and fish sauce, and stir well. Simmer for 20-25 minutes until the chicken is cooked through. Cook the egg noodles according to the package instructions. Serve the chicken curry over the egg noodles. Garnish with chopped cilantro, lime wedges, green onions, red onions, and pickled mustard greens. Serve hot.",
          "rating": 4.6
        }
      ]
    }
]    